Tekla Open API Reference for Tekla Structures 2025
SectionMark Constructor
Overload List
Name | Description
SectionMark(View, Point, Point)
 Creates a new section mark instance with the given positions.
SectionMark(View, Point, Point, SectionMarkBase.SectionMarkAttributes)
 Creates a new section mark instance with the given positions and attributes.
Top
See Also
Reference
SectionMark Class
Tekla.Structures.Drawing Namespace